app/Controllers/_2301020116_KaprodiController.php

SELECT *
FROM `prodi`
WHERE `id_user_kaprodi` = '9'
---
    private function getMyProdiID() {
        $db = \Config\Database::connect();
        $prodi = $db->table('prodi')->where('id_user_kaprodi', session()->get('id_user'))->get()->getRow();

INSERT INTO `pertanyaan` (`pertanyaan`, `id_prodi`) VALUES ('Apakah sudah mantap eao', '1')
INSERT INTO `pertanyaan_periode_kuisioner` (`id_periode_kuisioner`, `id_pertanyaan`) VALUES ('100', 204)
---
    public function store_pertanyaan() {
        $db = \Config\Database::connect();
        $tanyaModel = new _2301020063_PertanyaanModel();
        $pilihModel = new _2301020063_PilihanModel();
        $id_prodi = $this->getMyProdiID();

        $id_pertanyaan = $tanyaModel->insert(['pertanyaan' => $this->request->getPost('pertanyaan'), 'id_prodi' => $id_prodi]);
        $db->table('pertanyaan_periode_kuisioner')->insert(['id_periode_kuisioner' => $this->request->getPost('id_periode'), 'id_pertanyaan' => $id_pertanyaan]);

SELECT *
FROM `pertanyaan`
WHERE `id_pertanyaan` = '102'
AND `id_prodi` = '1'
 LIMIT 1
UPDATE `pertanyaan` SET `pertanyaan` = 'Apakah modul praktikum Web relevan?'
WHERE `pertanyaan`.`id_pertanyaan` IN ('102')
---
    public function update_pertanyaan() {
        $tanyaModel = new _2301020063_PertanyaanModel();
        $id_pertanyaan = $this->request->getPost('id_pertanyaan');
        $id_prodi_saya = $this->getMyProdiID();
        $cek = $tanyaModel->where('id_pertanyaan', $id_pertanyaan)->where('id_prodi', $id_prodi_saya)->first();

        if($cek) {
            $tanyaModel->update($id_pertanyaan, ['pertanyaan' => $this->request->getPost('pertanyaan')]);

SELECT *
FROM `pertanyaan`
WHERE `id_pertanyaan` = '102'
AND `id_prodi` = '1'
 LIMIT 1
DELETE FROM `pertanyaan`
WHERE `id_pertanyaan` IN ('102')
---
    public function delete_pertanyaan($id_pertanyaan) {
        $tanyaModel = new _2301020063_PertanyaanModel();
        $id_prodi_saya = $this->getMyProdiID();
        $cek = $tanyaModel->where('id_pertanyaan', $id_pertanyaan)->where('id_prodi', $id_prodi_saya)->first();

        if($cek) {
            $tanyaModel->delete($id_pertanyaan);